[
    "Many years ago, there was a woodcutter.",
    "He lived deep in the forest with his wife.",
    "She was a kind and gentle woman.",
    "They had two children: Hansel and Gretel.",
    "Family portrait",
    "The family did not have much money, but their home was always cozy and warm, and the children always had soup and bread to eat.",
    "They never went hungry.",
    "One year, there was a terribly cold winter, and Hansel and Gretel's mother became ill and died.",
    "Family portrait, without the mother",
    "In time the woodcutter married another woman, but she was not kind and gentle.",
    "She was cruel and selfish.",
    "She wanted to be rich, and she wanted to eat fancy foods like roast beef, mashed potatoes, peas, corn, lemon cakes, and exotic fruits from sunny lands.",
    "She was angry that they could only afford soup and bread for every meal.",
    "\"Soup and bread! Soup and bread! Every day! Soup and bread! I am so tired of soup and bread!\" she complained.",
    "Family portrait with the new stepmother",
    "The stepmother was especially cruel to Hansel and Gretel because she believed they were the reason the family was so poor.",
    "\"You children eat too much! It's your fault that we only have soup and bread!\"",
    "She wanted the children gone.",
    "One day, while the woodcutter was out cutting wood, the stepmother called Hansel and Gretel into the kitchen of their cottage.",
    "\"There is not enough food to make soup for dinner\", said the stepmother.",
    "\"We will all go hungry tonight. Go into the forest and pick some mushrooms to make a mushroom soup. I know where the best mushrooms grow…\"",
    "Stepmother ordering Hansel and Gretel to find mushrooms",
    "Then she gave them the most confusing directions she could think of.",
    "She knew they would never be able to find their way home.",
    "\"Walk north for two hours, turn left at the tall trees, walk east for twenty minutes, continue straight ahead, cross the stream, turn right onto the main road, go through the hole in the fence, walk under the bridge (watch out for the troll), and then three miles inside the forest, you will find some mushrooms under a tree. Go now so you can be back in time for dinner.\"",
    "Hansel and Gretel were scared.",
    "They knew the forest was deep and dark, and that it was easy to get lost.",
    "\"Don't worry! I have a plan!\" whispered Hansel to Gretel. He went to the back of the house and filled his pockets with white pebbles from the garden.",
    "Then the two children started walking, following their stepmother\"s directions. Every few steps, Hansel dropped a little white pebble on the ground.",
    "Hansel and Gretel in the woods",
    "They walked for hours, but they did not find any mushrooms.",
    "\"It\"s almost night time.",
    "I\"m scared,\" said Gretel, crying.",
    "\"Don't worry. I can find the way home!\" said Hansel.",
    "Hansel waited until the moon was bright.",
    "The moonlight shone through the tall trees and made his tiny white pebbles glow.",
    "They followed the trail of pebbles all the way back home.",
    "Their stepmother was furious.",
    "She didn't expect the children to find their way home.",
    "\"Little fools! Where are the mushrooms?\" the stepmother shouted.",
    "\"Now we have nothing to eat! There will be no dinner for you tonight! Go straight to bed!\"",
    "The children went to bed hungry.",
    "The next morning, after the woodcutter left for work, the stepmother woke the children up.",
    "\"Wake up! Wake up you little fools! Today is your father\"s birthday.",
    "I want to make him an apple pie for his birthday dinner.",
    "Go into the forest and pick some apples.",
    "This time I will come too.",
    "I know where we can find a big apple tree.",
    "\"",
    "She gave them a loaf of bread for their lunch, and then she hurried them out the house.",
    "Hansel did not have time to collect any pebbles.",
    "But clever Hansel had a plan.",
    "He did not eat his bread for lunch.",
    "Instead, he tore it into tiny crumbs.",
    "Every few steps, he dropped a crumb to mark the path.",
    "Hansel dropping breadcrumbs",
    "They followed their stepmother down the path, around a corner, and through the forest.",
    "\"Further! Further!\" said the stepmother.",
    "They went deeper into the forest.",
    "They turned left.",
    "They turned right.",
    "\"Further! Further!\" said the stepmother.",
    "Finally they stopped, and the stepmother sat down to rest.",
    "She pointed to a very dark part of the forest.",
    "\"The apple tree is over there!\"",
    "The children walked deeper into the forest, but they didn't see the apple tree.",
    "\"Where?\" they called.",
    "\"Just a little further!\" called the stepmother.",
    "Hansel and Gretel walked deeper and deeper into the forest, but they still didn't see the apple tree.",
    "\"Where?\" they called a second time.",
    "\"Just a little further!\" replied the stepmother.",
    "Her voice was very faint now.",
    "Hansel and Gretel walked and walked, deeper and deeper.",
    "No apple tree.",
    "\"Where?\" they called a third time.",
    "But there was no reply from their stepmother.",
    "She was gone.",
    "\"Oh no! We are lost!\" said Gretel, crying.",
    "\"Don\"t worry, I have a plan,\" said Hansel.",
    "He turned around to find the crumbs, but they were gone!",
    "The hungry birds had stolen every piece of bread!",
    "Hansel and Gretel huddling in some bushes at night",
    "\"I'm scared,\" wept Gretel. \"And I'm cold, and hungry, and I want to go home!\"",
    "\"Don't worry. Everything will be alright,\" Hansel said, trying to be brave. But he was scared, too.",
    "That night, the children slept in some soft bushes to stay warm.",
    "When they woke up, the sun was shining, the birds were singing, and there was a sweet, delicious smell in the air.",
    "\"I am so hungry,\" said Gretel.",
    "\"I think I smell cookies….\"",
    "\"Look!\" said Hansel, pointing.",
    "\"A house!\"",
    "It was the strangest house they had ever seen.",
    "The walls looked like yellow lemon cookies.",
    "The windows looked like they were made of chocolate.",
    "The roof looked like it was made of green and red candies.",
    "Hansel was starving.",
    "So he ran to the house and broke off a piece of the wall.",
    "\"This tastes like a lemon cookie!\" he said, surprised.",
    "Hansel and Gretel seeing the gingerbread cottage",
    "Gretel grabbed a piece of a window and stuffed it in her mouth.",
    "\"This is chocolate!\"",
    "The children could not stop eating.",
    "\"We'll stay here forever,\" Hansel declared, munching on the apple pie porch.",
    "They were just about to try a piece of the purple candy door when it quietly swung open.",
    "\"Hello!\" said an old woman from behind the door.",
    "\"Do you children like sweets? I have more inside the house! Come in! Come in! Don\"t be afraid!",
    "\"",
    "The old woman looked kind and friendly, so the two children went inside.",
    "Oh no!",
    "Bad idea!",
    "The old woman was not kind and friendly at all.",
    "She was an evil witch!",
    "As soon as Hansel and Gretel were inside, she slammed the door and locked it.",
    "The children were trapped.",
    "The evil witch grabbing Hansel's arm",
    "The witch grabbed Hansel by his wrist.",
    "\"You're too thin!\" she said. \"I must fatten you up before I eat you!\" Then she threw Hansel into a cage and locked the door.",
    "She turned to Gretel.",
    "\"Foolish girl. You will do the household chores, then I'll eat you too!\"",
    "Hansel began to cry.",
    "\"Please don\"t eat me!",
    "\" he begged.",
    "But Gretel stayed calm.",
    "\"Don\"t worry.",
    "Now I have a plan!",
    "\" whispered Gretel.",
    "Then Gretel snuck over to her brother, and she gave him a twig.",
    "\"Tomorrow morning, the witch will see if you are fat enough to eat. When she comes, give her this twig instead of your finger,\" she ordered.",
    "Gretel giving a twig to Hansel in his cage",
    "Sure enough, in the morning, the witch hobbled over to Hansel and growled, \"Stick your finger through the cage. I want to see if you are fat enough to eat!\"",
    "Hansel held out the twig.",
    "\"You're still too thin!\" she complained. \"Come here, foolish girl, and give your brother more sweets to eat.\"",
    "This continued for an entire week.",
    "Every day, the witch checked to see if Hansel was fat enough.",
    "Every day, Hansel held out the twig.",
    "Finally, the witch got tired of waiting.",
    "On the eighth day, she called to Gretel: \"Come here, foolish girl! Light the oven. Today I am going to eat roasted boy with carrots and gravy! Check if the oven is hot enough to roast your brother.\"",
    "But clever little Gretel had another plan.",
    "She started to cry.",
    "\"But I am too stupid. How do I know if the oven is hot enough? Can you show me?\" she asked.",
    "The witch muttered and grumbled: \"Useless child! I'll check the oven myself.\"",
    "The witch bent down to look at the bright orange flames, and quickly Gretel pushed her into the oven and slammed the door shut.",
    "THUD!",
    "That was the end of the witch.",
    "Gretel pushing the witch into the oven",
    "Gretel unlocked Hansel\"s cage. The children found a basket and filled it with cakes and cookies, pies, and candies. Then they ran away as fast as they could.",
    "They ran all night.",
    "They ran through the forest.",
    "They ran under the bridge.",
    "They crawled through the hole in the fence.",
    "They turned left.",
    "They turned right.",
    "Left.",
    "Right.",
    "Left.",
    "Right.",
    "Eventually they heard the sound of someone cutting wood in the distance.",
    "It was the woodcutter!",
    "The children ran to their father and hugged him and kissed him.",
    "He cried and cried.",
    "But he was actually very happy.",
    "\"My sweet, sweet children! Where were you?\"",
    "The children running to greet their father",
    "Hansel and Gretel told the woodcutter the whole story.",
    "When he heard that their stepmother had abandoned them in the forest, he was furious.",
    "He ordered the stepmother to leave the house immediately and never return.",
    "That night, Hansel and Gretel and their father had a late birthday party.",
    "They ate all the sweets from the basket: cherry pie, chocolate cake, green and red candies, blue lollipops, and gingerbread cookies.",
    "Later that year, Hansel and Gretel were visiting the bakery in town when they saw an old woman begging for coins.",
    "It was their stepmother!",
    "\"Children! Please help me! I am starving!\" she begged.",
    "Gretel thought for a moment.",
    "She went inside the bakery and bought a small loaf of bread and a small bowl of soup.",
    "\"Here,\" Gretel said.",
    "\"Soup and bread. Your favorite.\"",
    "Hansel and Gretel never saw their stepmother ever again."
]